# -*- coding:UTF-8 -*-
from requests_html import HTMLSession
import re
import time
import random
user_agent_list = ["Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/68.0.3440.106 Safari/537.36",
                    "Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/67.0.3396.99 Safari/537.36",
                    "Mozilla/5.0 (Windows NT 10.0; …) Gecko/20100101 Firefox/61.0",
                    "Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/64.0.3282.186 Safari/537.36",
                    "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/62.0.3202.62 Safari/537.36",
                    "Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/45.0.2454.101 Safari/537.36",
                    "Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.0)",
                    "Mozilla/5.0 (Macintosh; U; PPC Mac OS X 10.5; en-US; rv:1.9.2.15) Gecko/20110303 Firefox/3.6.15",
                    ]
headers= random.choice(user_agent_list)

	
def parse_html(res): 
	targets = res.html.find('.listmain dd') 
	titles = [] 
	hrefs = [] 
	#print(len(targets))
	for i in range(12, len(targets)): 
		titles.append(targets[i].text) 
		hrefs.extend(list(targets[i].links)) 
	print(titles,hrefs)
	#f1 = open(("jymq.txt"),"a",encoding='utf-8')#将每一行以UTF-8输出到text文件。
	#f1.write(str(titles)+"\n")
	#f1.write(str(hrefs)+"\n")
	return titles, hrefs
def get_onepage(first_url, title, href, session, book_name): 
	url = first_url + href 
	res = session.get(url=url) 
	targets = res.html.find('#content') 
	content = targets[0].text 
	subb=r"手机阅读地址：http://m.biqukan.com，数据和书签与电脑站同步，无广告清新阅读！"
	suba=r"[笔趣看  www.biqukan.com]百度搜索“笔趣看小说网”手机阅读：m.biqukan.com"
	subc=r"请记住本书首发域名：www.biqukan.com。笔趣阁手机版阅读网址：m.biqukan.com"
	subd=r"水印广告测试"
	contents = re.sub(subb,' ',content)
	contents = re.sub(subc,' ',contents)
	contents = re.sub(subd,' ',contents)

	with open(book_name + '.txt', 'a', encoding='utf-8') as f: 
		f.write(' ' + title + ' ') 
		f.write(contents)
def main(): 
	first_url = 'http://www.biqukan.com' 
	session = HTMLSession() 
	#targets_url = input('请输入你要下载的小说地址：') 
	targets_url ='https://www.biqukan.com/0_104/'
	res = session.get(url=targets_url) 
	book_name = res.html.find('.info h2')[0].text 
	#titles,hrefs = parse_html(res) 
	titles = ['第三百三十四章；觅婉儿', '第三百三十五章；相见难', '第三百三十六章；喜当爹', '第三百三十七章；摸错了', '第二百三十八章；喝醉了', '第三百四十章；心没了', '第三百四十一章；要强大', '第三百四十二章；危机感', '第三百四十三章；臭警察', '第三百四十四章；月下殇', '第三百四十五章；面朝里', '第三百四十六章；一百年', '第三百四十七章；将出发', '第三百四十九章；中计了', '第三百五十章；入绝境', '第三百五十一章；寻死路', '第三百五十一章；寻死路', '第三百五十二章；小宠物', '第三百五十三章；小老头', '第三百五十四章；苦肉计', '第三百五十五章；吴莫愁', '第三百五十六章；不甘心', '第三百五十七章；王小川', '第三百五十八章；要剥皮', '第三百五十九章；望晴川', '第三百六十章；吓死你', '公告；今晚不更了。 家有冥妻', '第三百六十二章；魂出窍', '第三百六十三章；没戏了', '第三百六十四章；恩人啊', '第三百六十五章；名鬼医', '第三百六十六章；无语了', '第三百六十七章；卵击石', '第三百六十八章；伤心了', '第三百六十八章；心也碎', '第三百七十章；很狗血', '第三百七十一章；冥气罩', '第三百七十二章；没救了', '第三百七十三章；不相识', '第三百七十六章；再分离', '第三百七十八章；天蚕网', '第三百七十九章；灭鬼王', '第三百八十章；恍如梦', '第三百八十一章；伤心处', '第三百八十二章；逐天涯', '第三百八十三章；江湖游', '第三百八十四章；幽灵林', '第三百八十五章；一世缘', '第三百八十六章；浓雾中', '第三百八十七章；皆幻相', '第三百八十八章；青纱帐', '第三百八十九章；望娇兰', '第三百九十章；爷爷殇', '第三百九十一章；人凶了', '第三百九十二章；波波波', '第三百九十三章；被出棺', '第三百九十四章；臭道士', '第三百九十五章；小警察', '第三百九十六章；爆发了', '第三百九十七章；离家乡', '第三百九十八章；夜迷雾', '请假一天！ 家有冥妻', '第三百九十九章；午夜女纸人', '第四百章；纸人会跳舞', '第四百零一章；幽蓝的眼睛', '第四百零二章；大乔和小乔', '第四百零三章；纸人化灰烬', '第四百零四章；一切皆幻象', '第四百零五章；纸人流眼泪', '第四百零六章；纸人的复活', '第四百零七章；纸人变佣人', '第四百零八章；钟无艳生了', '第四百零九章；魂欲归何处', '第四百一十章；我儿子好丑', '第四百一十一章；上铺的女孩', '第四百一十二章；老妪or少女', '公告；郁闷！ 家有冥妻', '第四百一十三章；狐狸一条精', '第四百一十四章；饿货狐狸精', '第四百一十五章；蛮主胡媚儿', '第四百一十六章；头上的花色', '第四百一十七章；我是一君子', '第四百一十八章；胡媚儿反骨', '第四百一十九章；魅惑之妖毒', '第四百二十章；残酷的治疗', '第四百二十一章；仁至切义尽', '第四百二十二章；我要你的心', '第四百二十三章；忘忧谷血蛟', '第四百二十四章；爷爷的牵挂', '第四百二十五章；狡猾胡媚儿', '第四百二十六章；一脸的伤感', '第四百二十七章；人生多无奈', '第四百二十八章；迷雾曼陀山', '第四百二十九章；七哥显威风', '第四百三十章；妹夫大舅哥', '第四百三十一章；活鬼曼陀山', '第四百三十二章；王颖遭劫难', '第四百三十三章；温情钟无艳', '第四百三十四章；师傅一片情', '第四百三十五章；剖腹活人心', '第四百三十六章；王颖复活记', '第四百三十七章；跟我干一场', '第四百三十八章；重返忘忧谷', '第四百三十九章；午夜之奇遇', '第四百四十章；我是被逼的', '第四百四十一章；欺负胡媚儿', '第四百四十二章；我有些怒了', '第四百四十三章；胡媚儿发威', '第四百四十四章；太像我二叔', '第四百四十五章；胡媚儿遇难', '第四百四十六章 ；阴差又阳错', '第四百四十七章；我爹终现身', '第四百四十八章；二叔很可疑', '第四百四十九章；行云复活记', '第四百五十章；你想怎么死', '第四百五十一章；时间静止了', '第四百五十二章；一切皆孽缘', '第四百五十三章；婉儿归来记', '第四百五十四章；再杀莫少白', '第四百五十五章；跟王颖大婚', '第四百五十六章；我是你亲爹', '第四百五十七章；不是你儿子', '第三百五十八章；我想带她走', '第四百五十九章；妈妈看孙子', '第四百六十章；没看好咱妈', '第四百六十一章；曹璇多妩媚', '第三百六十二章；神医老乞丐', '第四百六十三章；无名老人家', '第四百六十三章；无名老人家', '第四百六十四章；无名真无名', '第四百六十五章；穿越大清朝', '第四百六十六章；不是外星人', '第四百六十七章；火枪VS寒剑', '第四百六十八章；有些小郁闷', '第四百六十九章；PK冯太医', '第四百七十章；身体和灵魂', '第四百七十一章；要见慈溪女', '第四百七十二章；邂逅霍元甲', '第四百七十三章；格格多刧运', '第四百七十四章；空间不兼容', '第四百七十五章；百年杀四方', '第四百七十六章；一切不是梦', '第四百七十七章；蜈蚣在东陵', '公告！今晚不更了！', '第四百七十八章；只身进皇陵', '第四百七十九章；会动的腐尸', '第四百八十章；喊我小爷爷', '第四百八十一章；午夜一声吼', '第四百八十二章；我要跟你走', '第四百八十三章；陪你一起穿', '第四百八十四章；小川满月酒', '第四百八十五章；我爹是人渣', '第四百八十六章；英子复活了', '第四百八十七章；王俊的阴谋', '第四百八十八章；纠结郁闷恨', '第四百八十九章；不要去逃避', '第四百九十章；护花使者', '第四百九十一章；校园混子', '第四百九十二章；高级杀手', '第四百九十三章；你没事吧', '第四百九十四章；伤自尊了', '第四百九十五章；午夜铃声', '第四百九十六章；奇幻之旅', '第四百九十七章；是人是鬼', '第四百九十八章；索魂之令', '第四百九十九章；梦或不是', '第五百零一章；并不完美（大结局）', '完本感言', '新书已发《青春有约》', '新书始发：《高冷总裁十九岁》', '新书《爱上一个不回家的女人》已发', '《》番外以上线!敬请关注!']
	hrefs = ['/0_104/4322566.html', '/0_104/4322576.html', '/0_104/4322580.html', '/0_104/4322593.html', '/0_104/4322596.html', '/0_104/4322599.html', '/0_104/4322605.html', '/0_104/4322608.html', '/0_104/4617863.html', '/0_104/4617895.html', '/0_104/4617897.html', '/0_104/4617899.html', '/0_104/4617900.html', '/0_104/4617901.html', '/0_104/4685118.html', '/0_104/4685136.html', '/0_104/4685142.html', '/0_104/4685144.html', '/0_104/4714630.html', '/0_104/4714632.html', '/0_104/4714636.html', '/0_104/4734888.html', '/0_104/4752429.html', '/0_104/4752430.html', '/0_104/4775594.html', '/0_104/4775595.html', '/0_104/4793933.html', '/0_104/4793934.html', '/0_104/4793935.html', '/0_104/4793936.html', '/0_104/4816406.html', '/0_104/4816407.html', '/0_104/4816408.html', '/0_104/4816409.html', '/0_104/4816410.html', '/0_104/4816411.html', '/0_104/4823176.html', '/0_104/4827513.html', '/0_104/4827514.html', '/0_104/4842565.html', '/0_104/4854210.html', '/0_104/4854211.html', '/0_104/4869880.html', '/0_104/4869881.html', '/0_104/4869882.html', '/0_104/4869883.html', '/0_104/4869884.html', '/0_104/4887258.html', '/0_104/4887259.html', '/0_104/4887260.html', '/0_104/4893055.html', '/0_104/4901385.html', '/0_104/4901386.html', '/0_104/4917304.html', '/0_104/4917305.html', '/0_104/4917306.html', '/0_104/4917307.html', '/0_104/4917308.html', '/0_104/4917309.html', '/0_104/4929951.html', '/0_104/4933465.html', '/0_104/4942838.html', '/0_104/4950968.html', '/0_104/4952540.html', '/0_104/4957001.html', '/0_104/4957002.html', '/0_104/4967021.html', '/0_104/4971571.html', '/0_104/4971572.html', '/0_104/4986590.html', '/0_104/4986591.html', '/0_104/4986592.html', '/0_104/4993176.html', '/0_104/4998274.html', '/0_104/5001935.html', '/0_104/5014749.html', '/0_104/5014750.html', '/0_104/5016641.html', '/0_104/5017619.html', '/0_104/5018664.html', '/0_104/5019241.html', '/0_104/5038225.html', '/0_104/5042889.html', '/0_104/5042890.html', '/0_104/5045093.html', '/0_104/5047795.html', '/0_104/5058250.html', '/0_104/5058251.html', '/0_104/5061332.html', '/0_104/5072005.html', '/0_104/5072006.html', '/0_104/5090466.html', '/0_104/5100371.html', '/0_104/5100372.html', '/0_104/5138466.html', '/0_104/5138467.html', '/0_104/5138468.html', '/0_104/5138469.html', '/0_104/5144281.html', '/0_104/5191030.html', '/0_104/5191031.html', '/0_104/5210431.html', '/0_104/5210433.html', '/0_104/5230646.html', '/0_104/5230647.html', '/0_104/5253691.html', '/0_104/5253692.html', '/0_104/5266756.html', '/0_104/5266757.html', '/0_104/5275761.html', '/0_104/5296220.html', '/0_104/5296221.html', '/0_104/5315014.html', '/0_104/5315015.html', '/0_104/5374110.html', '/0_104/5374113.html', '/0_104/5374115.html', '/0_104/5374117.html', '/0_104/5374120.html', '/0_104/5374123.html', '/0_104/5374126.html', '/0_104/5374129.html', '/0_104/5377165.html', '/0_104/5391578.html', '/0_104/5391580.html', '/0_104/5420543.html', '/0_104/5420546.html', '/0_104/5433834.html', '/0_104/5433835.html', '/0_104/5433836.html', '/0_104/5496862.html', '/0_104/5504494.html', '/0_104/5538109.html', '/0_104/5538111.html', '/0_104/5553313.html', '/0_104/5561852.html', '/0_104/5577258.html', '/0_104/5582606.html', '/0_104/5582608.html', '/0_104/5603395.html', '/0_104/5610309.html', '/0_104/5610310.html', '/0_104/5614551.html', '/0_104/5627460.html', '/0_104/5632748.html', '/0_104/5644243.html', '/0_104/5649987.html', '/0_104/5652179.html', '/0_104/5655008.html', '/0_104/5672147.html', '/0_104/5672148.html', '/0_104/5682148.html', '/0_104/5682159.html', '/0_104/5694258.html', '/0_104/5694259.html', '/0_104/5697955.html', '/0_104/5707427.html', '/0_104/5707428.html', '/0_104/5707429.html', '/0_104/5711976.html', '/0_104/5734597.html', '/0_104/5734598.html', '/0_104/5784540.html', '/0_104/5784541.html', '/0_104/5828027.html', '/0_104/5855059.html', '/0_104/5876575.html', '/0_104/5885819.html', '/0_104/7011402.html', '/0_104/21125884.html', '/0_104/21125886.html', '/0_104/21125887.html']
	

	for i in range(len(titles)): 
		#print(titles,hrefs)
		get_onepage(first_url, titles[i], hrefs[i], session, book_name)
		time.sleep(6)
		
if __name__ == '__main__': 
	main()
